# 4)Дана последовательность чисел. Получить список неповторяющихся элементов исходной последовательности
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [1, 2, 3, 5, 10]
numbers_1 = [1, 2, 3, 5, 1, 5, 3, 10]
numbers_2 = [1, 2, 3, 5, 10]
result = list(set(numbers_1 + numbers_2))
print(result)